espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/test-harness-z3/test-harness-z3-zll.c
/***************************************************************************//**
 * @file
 * @brief ZigBee 3.0 touchlink test harness functionality
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "app/framework/include/af.h"

#include "test-harness-z3-core.h"
#include "test-harness-z3-zll.h"

#include "app/framework/plugin/zll-commissioning-common/zll-commissioning.h"
#include "app/framework/plugin/interpan/interpan.h"

#ifdef UC_BUILD
#include "sl_component_catalog.h"
#ifdef SL_CATALOG_ZIGBEE_NETWORK_CREATOR_PRESENT
#include "network-creator.h"
#endif
#else // !UC_BUILD
#ifdef EMBER_AF_PLUGIN_NETWORK_CREATOR
#include EMBER_AF_API_NETWORK_CREATOR
#define SL_CATALOG_ZIGBEE_NETWORK_CREATOR_PRESENT
#endif
#endif // UC_BUILD

#include "app/framework/util/common.h"

// -----------------------------------------------------------------------------
// Types

typedef struct {
  uint32_t transactionId;
  EmberAfProfileId profileId;
  uint16_t keyBitmask;
  bool setReservedInformationBits;
  uint8_t networkUpdateId;
  uint8_t numberSubDevices;
  EmberEUI64 destinationEui64;
} ScanResponseData;

// -----------------------------------------------------------------------------
// Globals
extern uint8_t emSetNwkUpdateId(uint8_t id);
// We need this extern'd for unit tests since the zll-commissioning.h extern
// might not be compiled in.
#if defined(EMBER_SCRIPTED_TEST)
extern uint32_t emAfZllSecondaryChannelMask;
#endif

static EmberZllNetwork zllNetwork = { { 0, }, { 0, 0, 0 }, };
#define initZllNetwork(network) \
  do { MEMMOVE(&zllNetwork, network, sizeof(EmberZllNetwork)); } while (0);
#define deinitZllNetwork() \
  do { zllNetwork.securityAlgorithm.transactionId = 0; } while (0);
#define zllNetworkIsInit() \
  (zllNetwork.securityAlgorithm.transactionId != 0)

#define STATE_PRIMARY_CHANNELS (0x01)
#define STATE_SCANNING         (0x02)
static uint8_t state;

#define NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE (BIT32(0))
#define NEGATIVE_BEHAVIOR_DELAY_RESPONSE     (BIT32(1))
#define NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE  (BIT32(2))
#define NEGATIVE_BEHAVIOR_POSITIVE_RESPONSE  (BIT32(3))
#define NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID (BIT32(4))
#define NEGATIVE_BEHAVIOR_BAD_COMMAND_ID     (BIT32(5))
#define NEGATIVE_BEHAVIOR_BAD_SOURCE_ADDRESS (BIT32(6))
#define NEGATIVE_BEHAVIOR_BAD_STATUS         (BIT32(7))
static uint32_t negativeBehaviorMask = 0;
static uint8_t negativeBehaviorCommandId = 0xFF;
static uint32_t responseBehaviorMask = 0;

static bool setInteropBit = true;  // bit setting in scan request

static ScanResponseData globalScanResponseData = { 0, };

#ifdef UC_BUILD
sl_zigbee_event_t emberAfPluginTestHarnessZ3ZllStuffEvent;
#define z3ZllStuffEventControl (&emberAfPluginTestHarnessZ3ZllStuffEvent)
void emberAfPluginTestHarnessZ3ZllStuffEventHandler(SLXU_UC_EVENT);
#else
EmberEventControl emberAfPluginTestHarnessZ3ZllStuffEventControl;
#define z3ZllStuffEventControl emberAfPluginTestHarnessZ3ZllStuffEventControl
#endif

#define ZLL_STUFF_EVENT_CONTROL_ACTION_SCAN_RESPONSE (0x00)
#define ZLL_STUFF_EVENT_CONTROL_ACTION_NULL          (0xFF)
static uint8_t zllStuffEventControlAction;

#define RESPONSE_ID 0xACACACAC

#define ENDPOINT       0x01
#define DEVICE_ID      0x1234
#define DEVICE_VERSION 0x01
#define GROUP_COUNT    0x00

// private stack API's in zll-address-assignment.c
void emZllSetForcedAddressAssignment(EmberZllAddressAssignment *assignment);
void emZllClearForcedAddressAssignment(void);

// private plugin API's.
EmberStatus emAfZllFormNetworkForRouterInitiator(uint8_t channel, int8_t radioPower, EmberPanId panId);

// MAC header constants (see interpan.c for details)
//ToDo: EMZIGBEE-4854 instead of this we need to use the umac version
#ifdef EZSP_HOST
#define MAC_FRAME_SOURCE_MODE_LONG  0xC000
#define MAC_FRAME_DESTINATION_MODE_LONG    0x0C00
#endif

#define LONG_DEST_FRAME_CONTROL  (MAC_FRAME_TYPE_DATA               \
                                  | MAC_FRAME_DESTINATION_MODE_LONG \
                                  | MAC_FRAME_SOURCE_MODE_LONG)
#define MAC_ACK_REQUIRED              0x0020
#define BROADCAST_PAN_ID 0xffff

// -----------------------------------------------------------------------------
// Util

static EmberStatus startScan(void)
{
  EmberNodeType nodeType;

  nodeType = (((emAfPluginTestHarnessZ3DeviceMode
                == EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZR_NOT_ADDRESS_ASSIGNABLE)
               || (emAfPluginTestHarnessZ3DeviceMode
                   == EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZR_ADDRESS_ASSIGNABLE))
              ? EMBER_ROUTER
              : EMBER_END_DEVICE);

  emberAfDebugPrintln("startScan: dev mode = %d, nodeType = %d", emAfPluginTestHarnessZ3DeviceMode, nodeType);

  EmberTokTypeStackZllData token;
  emberZllGetTokenStackZllData(&token);

  if ((emAfPluginTestHarnessZ3DeviceMode
       == EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZR_NOT_ADDRESS_ASSIGNABLE)
      || (emAfPluginTestHarnessZ3DeviceMode
          == EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZED_NOT_ADDRESS_ASSIGNABLE)) {
    token.bitmask &= ~EMBER_ZLL_STATE_ADDRESS_ASSIGNMENT_CAPABLE;
  }

  if (!setInteropBit) {
    token.bitmask &= ~EMBER_ZLL_STATE_PROFILE_INTEROP;
  }
  emberZllSetTokenStackZllData(&token);

  return emberZllStartScan(emberGetZllPrimaryChannelMask() | emberGetZllSecondaryChannelMask(),
                           0, // default power
                           nodeType);
}

static EmberNodeType getLogicalNodeType(void)
{
  EmberNodeType nodeType;
  EmberStatus status = emberAfGetNodeType(&nodeType);

  // Note, we only report as a coordinator if we are a currently
  // coordinator on a centralized network.
  if (status == EMBER_NOT_JOINED) {
    nodeType = emAfCurrentZigbeeProNetwork->nodeType;
    if (nodeType == EMBER_COORDINATOR) {
      nodeType = EMBER_ROUTER;
    }
  }
  return nodeType;
}

static uint8_t zigbeeInformation(void)
{
  uint8_t byte = 0x00;

