espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/test-harness-z3/test-harness-z3-zll.c
  EmberNodeType nodeType = getLogicalNodeType();
  // Set zigbee information based on the node type
  switch (nodeType) {
    case EMBER_COORDINATOR:
      byte = 0x04; //EMBER_COORDINATOR with RX ON When Idle
      break;
    case EMBER_ROUTER:
      byte = (0x01 | 0x04); // EMBER_ROUTER with RX ON When Idle
      break;
    case EMBER_END_DEVICE:
      byte = (0x02 | 0x04);  // ED with RX ON When Idle
      break;
    case EMBER_SLEEPY_END_DEVICE:
      byte = 0x02;  // ED without RX ON When Idle
    default:
      break; // nothing
  }

  if (globalScanResponseData.setReservedInformationBits) {
    byte |= (0xF0 | 0x08);
  }

  return byte;
}

static uint8_t zllInformation(void)
{
  uint8_t byte;
  EmberTokTypeStackZllData token;

  emberZllGetTokenStackZllData(&token);
  byte = BYTE_0(token.bitmask);

  switch (emAfPluginTestHarnessZ3DeviceMode) {
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZR_NOT_ADDRESS_ASSIGNABLE:
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZED_NOT_ADDRESS_ASSIGNABLE:
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_SLEEPY_ZED_NOT_ADDRESS_ASSIGNABLE:
      byte &= ~EMBER_ZLL_STATE_ADDRESS_ASSIGNMENT_CAPABLE;
      break;
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZR_ADDRESS_ASSIGNABLE:
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_ZED_ADDRESS_ASSIGNABLE:
    case EM_AF_PLUGIN_TEST_HARNESS_Z3_DEVICE_MODE_SLEEPY_ZED_ADDRESS_ASSIGNABLE:
    default:
      byte |= EMBER_ZLL_STATE_ADDRESS_ASSIGNMENT_CAPABLE;
      break;
  }

  if (globalScanResponseData.setReservedInformationBits) {
    byte |= (0x40 | 0x20 | 0x10);
  }

  return byte;
}

// Uses the global variable globalScanResponseData.
static EmberStatus sendScanResponse(void)
{
  EmberNodeType nodeType;
  EmberNetworkParameters networkParams;
  EmberStatus status;

  uint8_t payload[39]; // scan response payload is always 39 bytes
  uint8_t *finger = payload;

  status = emberAfGetNetworkParameters(&nodeType, &networkParams);
  if (status != EMBER_SUCCESS) {
    return status;
  }

  // ZCL.
  *finger++ = 0x19; // FC (cluster-specific, server to client)
  *finger++ = 0xAC; // sequence
  *finger++ = 0x01; // command ID (scan response)

  // ZLL.
  emberAfCopyInt32u(finger, 0, globalScanResponseData.transactionId);
  finger += sizeof(globalScanResponseData.transactionId);
  *finger++ = 0x00; // RSSI correction - whatever
  *finger++ = zigbeeInformation();
  *finger++ = zllInformation();
  emberAfCopyInt16u(finger, 0, globalScanResponseData.keyBitmask);
  finger += sizeof(globalScanResponseData.keyBitmask);
  emberAfCopyInt32u(finger, 0, RESPONSE_ID);
  finger += sizeof(RESPONSE_ID);
  MEMMOVE(finger, networkParams.extendedPanId, EXTENDED_PAN_ID_SIZE);
  finger += EXTENDED_PAN_ID_SIZE;
  *finger++ = globalScanResponseData.networkUpdateId;
  *finger++ = networkParams.radioChannel;
  emberAfCopyInt16u(finger, 0, networkParams.panId);
  finger += sizeof(networkParams.panId);
  *finger++ = globalScanResponseData.numberSubDevices;
  *finger++ = 0x01; // endpoint
  emberAfCopyInt16u(finger, 0, globalScanResponseData.profileId);
  finger += sizeof(globalScanResponseData.profileId);
  emberAfCopyInt16u(finger, 0, DEVICE_ID);
  finger += sizeof(DEVICE_ID);
  *finger++ = DEVICE_VERSION;
  *finger++ = GROUP_COUNT;

  status = emberAfSendInterPan(0xFFFF, // pan ID
                               globalScanResponseData.destinationEui64,
                               emberLookupNodeIdByEui64(globalScanResponseData.destinationEui64),
                               0xFFFF, // multicast id - whatever
                               ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                               globalScanResponseData.profileId,
                               sizeof(payload),
                               payload);

  return status;
}

static uint8_t networkUpdateId(void)
{
  EmberNodeType nodeType;
  EmberNetworkParameters networkParams;

  emberAfGetNetworkParameters(&nodeType, &networkParams);

  return networkParams.nwkUpdateId;
}

// -----------------------------------------------------------------------------
// Touchlink CLI Commands

// plugin test-harness z3 touchlink scan-request-process <linkInitiator:1>
// <unused:1> <options:4>
void emAfPluginTestHarnessZ3TouchlinkScanRequestProcessCommand(SL_CLI_COMMAND_ARG)
{
  EmberStatus status = EMBER_INVALID_CALL;

#ifndef EZSP_HOST
  uint8_t linkInitiator = (uint8_t)emberUnsignedCommandArgument(0);
  uint32_t options      = emAfPluginTestHarnessZ3GetSignificantBit(2);

  setInteropBit = true;  // Set interop bit in scan request

  // We currently don't have a way to use the link initiator option.
  (void)linkInitiator;

  if (options & BIT32(1)) {
    // Use current channel for scanning.
    emberSetZllPrimaryChannelMask(BIT32(emberAfGetRadioChannel()));
    emberSetZllSecondaryChannelMask(0);
  } else if (options & BIT32(4)) {
    // Only use secondary channels for scanning.
    emberSetZllPrimaryChannelMask(0);
    emberSetZllSecondaryChannelMask(EMBER_ZLL_SECONDARY_CHANNEL_MASK);
  }

  if (options & BIT32(6)) {
    // Send scan request as legacy initiator.
    setInteropBit = false;
  }

  if (options & BIT32(3)) {
    // ignore scan-requests
    emberAfZllDisable();
    status = EMBER_SUCCESS;
  } else {
    emberAfZllEnable();
    emberAfZllSetInitialSecurityState();
    state = (STATE_PRIMARY_CHANNELS | STATE_SCANNING);
    status = startScan();
  }

#endif /* EZSP_HOST */

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Scan request process",
                     status);
}

// plugin test-harness z3 touchlink start-as-router
void emAfPluginTestHarnessZ3TouchlinkStartAsRouterCommand(SL_CLI_COMMAND_ARG)
{
#ifdef SL_CATALOG_ZIGBEE_NETWORK_CREATOR_PRESENT
  EmberPanId panId = (EmberPanId)emberUnsignedCommandArgument(0);
  uint32_t options = emAfPluginTestHarnessZ3GetSignificantBit(1);
  EmberStatus status = EMBER_INVALID_CALL;

  // This options bitmask is currently unused.
  (void)options;

