espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/test-harness-z3/test-harness-z3-zll.c
  if (zllNetworkIsInit()) {
    status = emAfZllFormNetworkForRouterInitiator(zllNetwork.zigbeeNetwork.channel,
                                                  EMBER_AF_PLUGIN_ZLL_COMMISSIONING_COMMON_RADIO_TX_POWER,
                                                  panId);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Start as router",
                     status);
#endif
}

// plugin test-harness z3 touchlink is-scanning
void emAfPluginTestHarnessZ3TouchlinkIsScanningCommand(SL_CLI_COMMAND_ARG)
{
  emberAfCorePrintln("scanning:%s",
                     (state & STATE_SCANNING ? "true" : "false"));
}

// plugin test-harness z3 touchlink device-information-request
// <startIndex:1> <options:4>
void emAfPluginTestHarnessZ3TouchlinkDeviceInformationRequestCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t startIndex = (uint8_t)emberUnsignedCommandArgument(0);
  uint32_t options   = emAfPluginTestHarnessZ3GetSignificantBit(1);
  EmberStatus status = EMBER_INVALID_CALL;

  uint32_t interpanTransactionId = zllNetwork.securityAlgorithm.transactionId;
  if (options & BIT(0)) {
    interpanTransactionId--;
  }

  emberAfDebugPrintln("DeviceInfoRq, zllNetworkIsInit(): %d, tr id = %d", zllNetworkIsInit(), interpanTransactionId);
  if (zllNetworkIsInit()) {
    (void) emberAfFillExternalBuffer(EM_AF_PLUGIN_TEST_HARNESS_Z3_ZLL_CLIENT_TO_SERVER_FRAME_CONTROL,
                                     ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                     ZCL_DEVICE_INFORMATION_REQUEST_COMMAND_ID,
                                     "wu",
                                     interpanTransactionId,
                                     startIndex);
    status = emberAfSendCommandInterPan(0xFFFF,                // destination pan id
                                        zllNetwork.eui64,
                                        EMBER_NULL_NODE_ID,    // node id - ignored
                                        0x0000,                // group id - ignored
                                        emAfPluginTestHarnessZ3TouchlinkProfileId);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Device information request",
                     status);
}

// plugin test-harness z3 touchlink device-information-request-w-target
// <startIndex:1> <shortAddress:2> <options:4>
void emAfPluginTestHarnessZ3TouchlinkDeviceInformationRequestWTargetCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t startIndex = (uint8_t)emberUnsignedCommandArgument(0);
  uint16_t shortAddress = (uint16_t)emberUnsignedCommandArgument(1);
  uint32_t options   = emAfPluginTestHarnessZ3GetSignificantBit(2);
  EmberStatus status = EMBER_INVALID_CALL;

  uint32_t interpanTransactionId = zllNetwork.securityAlgorithm.transactionId;
  if (options & BIT(0)) {
    interpanTransactionId--;
  }
  (void)options;

  if (zllNetworkIsInit()) {
    (void) emberAfFillExternalBuffer(EM_AF_PLUGIN_TEST_HARNESS_Z3_ZLL_CLIENT_TO_SERVER_FRAME_CONTROL,
                                     ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                     ZCL_DEVICE_INFORMATION_REQUEST_COMMAND_ID,
                                     "wu",
                                     interpanTransactionId,
                                     startIndex);
    // TODO: It would probably be better to use ZDO to get the target EUI64, but
    // then we would still need to do a scan to start an active transaction.
    status = emberAfSendCommandInterPan(0xFFFF, // destination pan id
                                        zllNetwork.eui64,  // to keep NWK happy
                                        shortAddress, // node id
                                        0x0000,       // group id - ignored
                                        emAfPluginTestHarnessZ3TouchlinkProfileId);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Device information request w target",
                     status);
}

// plugin test-harness z3 touchlink identify-request <duration:2> <options:4>
void emAfPluginTestHarnessZ3TouchlinkIdentifyRequestCommand(SL_CLI_COMMAND_ARG)
{
  uint16_t duration = (uint16_t)emberUnsignedCommandArgument(0);
  uint32_t options  = emAfPluginTestHarnessZ3GetSignificantBit(1);
  EmberStatus status = EMBER_INVALID_CALL;

  uint32_t interpanTransactionId = zllNetwork.securityAlgorithm.transactionId;
  if (options & BIT(0)) {
    interpanTransactionId--;
  }

  if (zllNetworkIsInit()) {
    (void) emberAfFillExternalBuffer(EM_AF_PLUGIN_TEST_HARNESS_Z3_ZLL_CLIENT_TO_SERVER_FRAME_CONTROL,
                                     ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                     ZCL_IDENTIFY_REQUEST_COMMAND_ID,
                                     "wv",
                                     interpanTransactionId,
                                     duration);
    status = emberAfSendCommandInterPan(0xFFFF,     // destination pan id
                                        zllNetwork.eui64,
                                        EMBER_NULL_NODE_ID, // node id - ignored
                                        0x0000,           // group id - ignored
                                        emAfPluginTestHarnessZ3TouchlinkProfileId);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Identify request",
                     status);
}

// plugin test-harness z3 touchlink reset-to-factory-new-request <options:4>
void emAfPluginTestHarnessZ3TouchlinkRTFNRequestCommand(SL_CLI_COMMAND_ARG)
{
  uint32_t options  = emAfPluginTestHarnessZ3GetSignificantBit(0);
  EmberStatus status = EMBER_INVALID_CALL;

  // We currently do not have a way to use the option bitmask.
  (void)options;

  if (zllNetworkIsInit()) {
    (void) emberAfFillExternalBuffer(EM_AF_PLUGIN_TEST_HARNESS_Z3_ZLL_CLIENT_TO_SERVER_FRAME_CONTROL,
                                     ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                     ZCL_RESET_TO_FACTORY_NEW_REQUEST_COMMAND_ID,
                                     "w",
                                     zllNetwork.securityAlgorithm.transactionId);
    if (options & BIT(0)) {
      status = emberAfSendCommandInterPan(0xFFFF,     // destination pan id
                                          NULL,       // long id - ignored
                                          EMBER_BROADCAST_ADDRESS,// bcast
                                          0x0000,     // group id - ignored
                                          emAfPluginTestHarnessZ3TouchlinkProfileId);
    } else {
      status = emberAfSendCommandInterPan(0xFFFF,     // destination pan id
                                          zllNetwork.eui64,
                                          EMBER_NULL_NODE_ID,// node id- ignored
                                          0x0000,          // group id - ignored
                                          emAfPluginTestHarnessZ3TouchlinkProfileId);
    }
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Reset to factory new request",
                     status);
}

