espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/test-harness-z3/test-harness-z3-zll.c
// plugin test-harness z3 touchlink get-group-identifiers-request
// <startIndex:1>
void emAfPluginTestHarnessZ3TouchlinkGetGroupIdentifiersRequestCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t startIndex = emberUnsignedCommandArgument(0);
  EmberStatus status = EMBER_INVALID_CALL;
  EmberNodeId destination;

  if (zllNetworkIsInit()) {
    if ((destination = zllNetwork.nodeId) == EMBER_NULL_NODE_ID) {
      destination = emberLookupNodeIdByEui64(zllNetwork.eui64);
    }
    emberAfFillCommandZllCommissioningClusterGetGroupIdentifiersRequest(startIndex);
    emberAfSetCommandEndpoints(1, 1); // endpoints?
    status = emberAfSendCommandUnicast(EMBER_OUTGOING_DIRECT, destination);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Get group identifiers request",
                     status);
}

// plugin test-harness z3 touchlink get-endpoint-list-request
// <startIndex:1>
void emAfPluginTestHarnessZ3TouchlinkGetEndpointListRequestCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t startIndex = emberUnsignedCommandArgument(0);
  EmberStatus status = EMBER_INVALID_CALL;
  EmberNodeId destination;

  if (zllNetworkIsInit()) {
    if ((destination = zllNetwork.nodeId) == EMBER_NULL_NODE_ID) {
      destination = emberLookupNodeIdByEui64(zllNetwork.eui64);
    }
    emberAfFillCommandZllCommissioningClusterGetEndpointListRequest(startIndex);
    emberAfSetCommandEndpoints(1, 1); // endpoints?
    status = emberAfSendCommandUnicast(EMBER_OUTGOING_DIRECT, destination);
  }

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Get endpoint list request",
                     status);
}

// plugin test-harness z3 touchlink scan-response-config <options:4>
void emAfPluginTestHarnessZ3TouchlinkScanResponseConfigCommand(SL_CLI_COMMAND_ARG)
{
  uint32_t options = emAfPluginTestHarnessZ3GetSignificantBit(0);

  globalScanResponseData.keyBitmask = EMBER_ZLL_KEY_MASK_CERTIFICATION;
  globalScanResponseData.profileId = HA_PROFILE_ID; // use HA profile for endpoint info
  globalScanResponseData.setReservedInformationBits = false;
  globalScanResponseData.networkUpdateId = networkUpdateId();
  globalScanResponseData.numberSubDevices = 1;

  switch (options) {
    case BIT32(0):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID;
      break;
    case BIT32(1):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_POSITIVE_RESPONSE;
      break;
    case BIT32(2):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_DELAY_RESPONSE;
      break;
    case BIT32(3):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.keyBitmask = 0x0000;
      break;
    case BIT32(4):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.keyBitmask = 0x0001;
      break;
    case BIT32(5):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.setReservedInformationBits = true;
      break;
    case BIT32(6):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      // As per the nwkUpdateId roll over logic defined in the ZCL6.
      // 13.3.4.9 Frequency Agility, the following will set it low.
      globalScanResponseData.networkUpdateId += 201;
      break;
    case BIT32(7):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.networkUpdateId += 0x50;
      break;
    case BIT32(8):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE;
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE;
      break;
    case BIT32(9):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.numberSubDevices = 10;
      break;
    case BIT32(10):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.networkUpdateId += 0x5A;
      break;
    case BIT32(11):
      negativeBehaviorMask |= NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE;
      globalScanResponseData.keyBitmask = 0x0020;
      break;
    default:
      ; // whatever
  }
  // Set the network update Id so that the scan responses to
  // multiple scan request produces the same id
  emSetNwkUpdateId(globalScanResponseData.networkUpdateId);
  negativeBehaviorCommandId = ZCL_SCAN_REQUEST_COMMAND_ID;

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Scan response config",
                     EMBER_SUCCESS);
}

// plugin test-harness z3 touchlink network-start-response-config <options:4>
void emAfPluginTestHarnessZ3TouchlinkNetworkStartResponseConfig(SL_CLI_COMMAND_ARG)
{
  uint32_t options = emberUnsignedCommandArgument(0);

  responseBehaviorMask = 0;
  if (options) {
    if (options & BIT32(0)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE;
    }
    if (options & BIT32(1)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_COMMAND_ID;
    }
    if (options & BIT32(2)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID;
    }
    if (options & BIT32(3)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_SOURCE_ADDRESS;
    }
    if (options & BIT32(4)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_STATUS;
    }
  }

  // All options are handled in the negative behaviour callbacks
  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Network start response config",
                     EMBER_SUCCESS);
}

// plugin test-harness z3 touchlink network-join-router-response-config <options:4>
void emAfPluginTestHarnessZ3TouchlinkNetworkJoinRouterResponseConfig(SL_CLI_COMMAND_ARG)
{
  uint32_t options = emberUnsignedCommandArgument(0);

  responseBehaviorMask = 0;
  if (options) {
    if (options & BIT32(0)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE;
    }
    if (options & BIT32(1)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_COMMAND_ID;
    }
    if (options & BIT32(2)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID;
    }
    if (options & BIT32(3)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_SOURCE_ADDRESS;
    }
    if (options & BIT32(4)) {
      responseBehaviorMask |= NEGATIVE_BEHAVIOR_BAD_STATUS;
    }
  }

  // All options are handled in the negative behaviour callbacks
  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Network join router response config",
                     EMBER_SUCCESS);
}

// plugin test-harness z3 touchlink device-information-response-config
// <options:4>
void emAfPluginTestHarnessZ3TouchlinkDeviceInformationResponseConfigCommand(SL_CLI_COMMAND_ARG)
{
  uint32_t options = emberUnsignedCommandArgument(0);

