espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/test-harness-z3/test-harness-z3-zll.c
  negativeBehaviorMask = 0;
  if (options & BIT32(0)) {
    negativeBehaviorMask |= NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE;
  }

  negativeBehaviorCommandId = ZCL_DEVICE_INFORMATION_REQUEST_COMMAND_ID;

  emberAfCorePrintln("%s: %s: 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Device information response config",
                     EMBER_SUCCESS);
}

// -----------------------------------------------------------------------------
// Framework callbacks

void emAfPluginTestHarnessZ3ZllNetworkFoundCallback(const EmberZllNetwork *networkInfo)
{
  emberAfCorePrintln("%p: %p: node type = %d, zll state = 0x%2X, node id = 0x%2X, pan id = 0x%2X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "Network found",
                     networkInfo->nodeType,
                     networkInfo->state,
                     networkInfo->nodeId,
                     networkInfo->zigbeeNetwork.panId);
  initZllNetwork(networkInfo);
}

void emAfPluginTestHarnessZ3ZllScanCompleteCallback(EmberStatus status)
{
  emberAfDebugPrintln("Scan Complete: status = %X, state = %X", status, state);

  if (!zllNetworkIsInit() && (state & STATE_PRIMARY_CHANNELS)) {
    state &= ~STATE_PRIMARY_CHANNELS;
    startScan();
  } else {
    state &= ~STATE_SCANNING;
    if (status != EMBER_SUCCESS) {
      deinitZllNetwork();
    } else {
      emberSetLogicalAndRadioChannel(zllNetwork.zigbeeNetwork.channel);
    }
    // Tell the API that we have finished scanning, so that it won't
    // attempt to re-use our old transaction code.
    emberZllScanningComplete();

    // Set the interop bit back to one, in case it was changed.
    EmberTokTypeStackZllData token;
    emberZllGetTokenStackZllData(&token);
    token.bitmask |= EMBER_ZLL_STATE_PROFILE_INTEROP;
    emberZllSetTokenStackZllData(&token);
  }
}

EmberPacketAction emAfPluginTestHarnessZ3ZllCommandCallback(uint8_t  *command,
                                                            EmberEUI64 sourceEui64)
{
  // The start index points at the beginning of the ZCL frame.
  // FRAME_CONTROL:1 | SEQUENCE:1 | COMMAND_ID:1 | start of transaction...
  uint32_t transactionIdIndex = 3;
  uint8_t commandId = command[2];
  uint32_t realTransactionId = emberFetchLowHighInt32u(command + transactionIdIndex);
  EmberPacketAction act = EMBER_ACCEPT_PACKET;

  // Print the source EUI64 for certain commands only
  if (commandId == ZCL_NETWORK_START_RESPONSE_COMMAND_ID
      || commandId == ZCL_NETWORK_JOIN_ROUTER_RESPONSE_COMMAND_ID
      || commandId == ZCL_SCAN_RESPONSE_COMMAND_ID) {
    emberAfCorePrint("sourceEui64: ");
    emberAfCorePrintBuffer(sourceEui64, 8, true); // spaces?
    emberAfCorePrintln("");
  }

  // Ignore any negative behavior if the command doesn't match up.
  if (commandId != negativeBehaviorCommandId) {
    return act;
  }

  globalScanResponseData.transactionId = realTransactionId;
  MEMMOVE(globalScanResponseData.destinationEui64, sourceEui64, EUI64_SIZE);

  if (negativeBehaviorMask
      & (NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE
         | NEGATIVE_BEHAVIOR_DELAY_RESPONSE
         | NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE)) {
    if (!(negativeBehaviorMask & NEGATIVE_BEHAVIOR_POSITIVE_RESPONSE)) {
      // Overwrite the transaction ID to be 0. This will make us not respond
      // to the command.
      emberStoreLowHighInt32u(command + transactionIdIndex, 0);
      act = EMBER_MANGLE_PACKET;
    }

    if (negativeBehaviorMask & NEGATIVE_BEHAVIOR_DELAY_RESPONSE) {
      // Delay 8 seconds, since this is the transaction ID lifetime.
      slxu_zigbee_event_set_delay_ms(z3ZllStuffEventControl,
                                     MILLISECOND_TICKS_PER_SECOND * 8);
      zllStuffEventControlAction = ZLL_STUFF_EVENT_CONTROL_ACTION_SCAN_RESPONSE;
    } else if (negativeBehaviorMask & NEGATIVE_BEHAVIOR_IMMEDIATE_RESPONSE) {
      // Send our own response immediately.
      slxu_zigbee_event_set_active(z3ZllStuffEventControl);
      zllStuffEventControlAction = ZLL_STUFF_EVENT_CONTROL_ACTION_SCAN_RESPONSE;
    }
  } else if (negativeBehaviorMask & NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID) {
    emberStoreLowHighInt32u(command + transactionIdIndex, realTransactionId - 1);
    act = EMBER_MANGLE_PACKET;
  }

  if (!slxu_zigbee_event_is_active(z3ZllStuffEventControl)) {
    negativeBehaviorMask = 0;
    negativeBehaviorCommandId = 0xFF;
  }
  return act;
}

void emberAfPluginTestHarnessZ3ZllStuffEventHandler(SLXU_UC_EVENT)
{
  EmberStatus status;

  slxu_zigbee_event_set_inactive(z3ZllStuffEventControl);

  switch (zllStuffEventControlAction) {
    case ZLL_STUFF_EVENT_CONTROL_ACTION_SCAN_RESPONSE:
      status = sendScanResponse();
      negativeBehaviorMask = 0;
      negativeBehaviorCommandId = 0xFF;
      break;
    default:
      status = EMBER_BAD_ARGUMENT;
  }

  emberAfCorePrintln("%p: %p (0x%X): 0x%X",
                     TEST_HARNESS_Z3_PRINT_NAME,
                     "ZLL event handler",
                     zllStuffEventControlAction,
                     status);

  zllStuffEventControlAction = ZLL_STUFF_EVENT_CONTROL_ACTION_NULL;
}

EmberPacketAction emAfPluginTestHarnessZ3ZllModifyInterpanCommand(uint8_t *commandData,
                                                                  uint8_t macHeaderLength)
{
  const static EmberEUI64 badEui64 = { 0xde, 0xed, 0xdd, 0xde, 0xed, 0xdd, 0xde, 0xdd };
  EmberPacketAction act = EMBER_ACCEPT_PACKET;

  uint8_t *apsPointer = commandData + macHeaderLength + 7;
  uint8_t cmdId = *(apsPointer + 2);
  emberAfDebugPrintln("Modify Interpan: cmd id = %d, mask = %4X", cmdId, responseBehaviorMask);

  if (cmdId == ZCL_NETWORK_START_RESPONSE_COMMAND_ID
      || cmdId == ZCL_NETWORK_JOIN_ROUTER_RESPONSE_COMMAND_ID
      || cmdId == ZCL_SCAN_RESPONSE_COMMAND_ID) {
    if (responseBehaviorMask & NEGATIVE_BEHAVIOR_SUPPRESS_RESPONSE) {
      return EMBER_DROP_PACKET;
    }

    // This is the only option which affects the MAC header
    if (responseBehaviorMask & NEGATIVE_BEHAVIOR_BAD_SOURCE_ADDRESS) {
      MEMMOVE(commandData + (macHeaderLength - 8), badEui64, EUI64_SIZE);
    }

    // The remaining options pertain to the APS payload
    if (responseBehaviorMask & NEGATIVE_BEHAVIOR_BAD_COMMAND_ID) {
      *(apsPointer + 2) = ZCL_NETWORK_JOIN_END_DEVICE_RESPONSE_COMMAND_ID;
    }
    if (responseBehaviorMask & NEGATIVE_BEHAVIOR_BAD_TRANSACTION_ID) {
      MEMSET(apsPointer + 3, 0, 4);
    }
    if (responseBehaviorMask & NEGATIVE_BEHAVIOR_BAD_STATUS) {
      *(apsPointer + 7) = EMBER_ERR_FATAL;
    }

    if (responseBehaviorMask) {
      act = EMBER_MANGLE_PACKET;
    }
  } else if (cmdId == ZCL_SCAN_RESPONSE_COMMAND_ID) {
    // Ensure the zigbee and touchlink information fields are set
    // according to our device mode - this is particularly important
    // for the address assignment capability bit.
    *(apsPointer + 8) = zigbeeInformation();
    *(apsPointer + 9) = zllInformation();
    act = EMBER_MANGLE_PACKET;
  }
  return act;
}
